# Pandas Transform - Merging GroupBy Results Back into Your DataFrame

https://www.youtube.com/watch?v=jcbRt3RWcGI

## Functions Covered

group = df.groupby('key')

df['sum'] = group.transform('sum')

In [1]:
import pandas as pd

pd.__version__

'0.25.1'

In [2]:
df = pd.DataFrame({
    'key' : ['a', 'a', 'b', 'c', 'c'],
    'val' : [1243, 456, 7, 32, 6] })
df

  key   val
0   a  1243
1   a   456
2   b     7
3   c    32
4   c     6

In [3]:
group = df.groupby('key')
group.head()

  key   val
0   a  1243
1   a   456
2   b     7
3   c    32
4   c     6

In [6]:
df['sum'] = group.transform('sum')
df

  key   val   sum
0   a  1243  1699
1   a   456  1699
2   b     7     7
3   c    32    38
4   c     6    38